<a href="https://colab.research.google.com/github/jaeheon209/prgrms-de/blob/master/assignment/4_week/assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import psycopg2

# Redshift connection 함수
def get_Redshift_connection():
    host = "grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com"
    redshift_user = ""
    redshift_pass = ""
    port = 5439
    dbname = "dev"
    conn = psycopg2.connect("dbname={dbname} user={user} host={host} password={password} port={port}".format(
        dbname=dbname,
        user=redshift_user,
        password=redshift_pass,
        host=host,
        port=port
    ))
    conn.set_session(autocommit=True)
    return conn.cursor()

# ETL 함수를 하나씩 정의

In [2]:
import requests

def extract(url):
    f = requests.get(link)
    return (f.text)

In [32]:
def transform(text):
    lines = text.split("\n")
    print(len(lines))
    print(len(lines[1:]))
    return lines[1:] # header remove

In [30]:
def load(text):
    cur = get_Redshift_connection()

    # 멱등하게 하기 위해 이전 데이터 삭제.
    sql = "DELETE FROM jaeheon209.name_gender"
    cur.execute(sql)

    for r in text:
        if r != '':
            (name, gender) = r.split(",")
            print(name, "-", gender)
            sql = "INSERT INTO jaeheon209.name_gender VALUES ('{name}', '{gender}')".format(name=name, gender=gender)
            print(sql)
            cur.execute(sql)

# 이제 Extract부터 함수를 하나씩 실행

In [4]:
link = "https://s3-geospatial.s3-us-west-2.amazonaws.com/name_gender.csv"

data = extract(link)

In [ ]:
lines = transform(data)

In [34]:
load(lines)

Adaleigh - F
INSERT INTO jaeheon209.name_gender VALUES ('Adaleigh', 'F')
Amryn - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Amryn', 'Unisex')
Apurva - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Apurva', 'Unisex')
Aryion - M
INSERT INTO jaeheon209.name_gender VALUES ('Aryion', 'M')
Alixia - F
INSERT INTO jaeheon209.name_gender VALUES ('Alixia', 'F')
Alyssarose - F
INSERT INTO jaeheon209.name_gender VALUES ('Alyssarose', 'F')
Arvell - M
INSERT INTO jaeheon209.name_gender VALUES ('Arvell', 'M')
Aibel - M
INSERT INTO jaeheon209.name_gender VALUES ('Aibel', 'M')
Atiyyah - F
INSERT INTO jaeheon209.name_gender VALUES ('Atiyyah', 'F')
Adlie - F
INSERT INTO jaeheon209.name_gender VALUES ('Adlie', 'F')
Anyely - F
INSERT INTO jaeheon209.name_gender VALUES ('Anyely', 'F')
Aamoni - F
INSERT INTO jaeheon209.name_gender VALUES ('Aamoni', 'F')
Ahman - M
INSERT INTO jaeheon209.name_gender VALUES ('Ahman', 'M')
Arlane - F
INSERT INTO jaeheon209.name_gender VALUES ('Arlane', 'F')
Armoney - F
INSERT INTO jaeheon209.name_gender VALUES ('Armoney', 'F')
Atzhiry - F
INSERT INTO jaeheon209.name_gender VALUES ('Atzhiry', 'F')
Antonette - F
INSERT INTO jaeheon209.name_gender VALUES ('Antonette', 'F')
Akeelah - F
INSERT INTO jaeheon209.name_gender VALUES ('Akeelah', 'F')
Abdikadir - M
INSERT INTO jaeheon209.name_gender VALUES ('Abdikadir', 'M')
Arinze - M
INSERT INTO jaeheon209.name_gender VALUES ('Arinze', 'M')
Arshaun - M
INSERT INTO jaeheon209.name_gender VALUES ('Arshaun', 'M')
Alexandro - M
INSERT INTO jaeheon209.name_gender VALUES ('Alexandro', 'M')
Ayriauna - F
INSERT INTO jaeheon209.name_gender VALUES ('Ayriauna', 'F')
Aqib - M
INSERT INTO jaeheon209.name_gender VALUES ('Aqib', 'M')
Alleya - F
INSERT INTO jaeheon209.name_gender VALUES ('Alleya', 'F')
Aavah - F
INSERT INTO jaeheon209.name_gender VALUES ('Aavah', 'F')
Anesti - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Anesti', 'Unisex')
Adalaide - F
INSERT INTO jaeheon209.name_gender VALUES ('Adalaide', 'F')
Analena - F
INSERT INTO jaeheon209.name_gender VALUES ('Analena', 'F')
Alaeyah - F
INSERT INTO jaeheon209.name_gender VALUES ('Alaeyah', 'F')
Albena - F
INSERT INTO jaeheon209.name_gender VALUES ('Albena', 'F')
Aimi - F
INSERT INTO jaeheon209.name_gender VALUES ('Aimi', 'F')
Adwaith - M
INSERT INTO jaeheon209.name_gender VALUES ('Adwaith', 'M')
Arkady - M
INSERT INTO jaeheon209.name_gender VALUES ('Arkady', 'M')
Astyn - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Astyn', 'Unisex')
Adelee - F
INSERT INTO jaeheon209.name_gender VALUES ('Adelee', 'F')
Agata - F
INSERT INTO jaeheon209.name_gender VALUES ('Agata', 'F')
Alegna - F
INSERT INTO jaeheon209.name_gender VALUES ('Alegna', 'F')
Altan - M
INSERT INTO jaeheon209.name_gender VALUES ('Altan', 'M')
Ahnaleigh - F
INSERT INTO jaeheon209.name_gender VALUES ('Ahnaleigh', 'F')
Algie - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Algie', 'Unisex')
Ashanti - F
INSERT INTO jaeheon209.name_gender VALUES ('Ashanti', 'F')
Aislyn - F
INSERT INTO jaeheon209.name_gender VALUES ('Aislyn', 'F')
Adaleine - F
INSERT INTO jaeheon209.name_gender VALUES ('Adaleine', 'F')
Anthnoy - M
INSERT INTO jaeheon209.name_gender VALUES ('Anthnoy', 'M')
Algernon - M
INSERT INTO jaeheon209.name_gender VALUES ('Algernon', 'M')
Aeryona - F
INSERT INTO jaeheon209.name_gender VALUES ('Aeryona', 'F')
Adrinne - F
INSERT INTO jaeheon209.name_gender VALUES ('Adrinne', 'F')
Addell - F
INSERT INTO jaeheon209.name_gender VALUES ('Addell', 'F')
Avril - F
INSERT INTO jaeheon209.name_gender VALUES ('Avril', 'F')
Ahni - F
INSERT INTO jaeheon209.name_gender VALUES ('Ahni', 'F')
Aimon - M
INSERT INTO jaeheon209.name_gender VALUES ('Aimon', 'M')
Adolpho - M
INSERT INTO jaeheon209.name_gender VALUES ('Adolpho', 'M')
Ahuva - F
INSERT INTO jaeheon209.name_gender VALUES ('Ahuva', 'F')
Aurielle - F
INSERT INTO jaeheon209.name_gender VALUES ('Aurielle', 'F')
Aveana - F
INSERT INTO jaeheon209.name_gender VALUES ('Aveana', 'F')
Aliyia - F
INSERT INTO jaeheon209.name_gender VALUES ('Aliyia', 'F')
Alesander - M
INSERT INTO jaeheon209.name_gender VALUES ('Alesander', 'M')
Adnrea - F
INSERT INTO jaeheon209.name_gender VALUES ('Adnrea', 'F')
Anjae - F
INSERT INTO jaeheon209.name_gender VALUES ('Anjae', 'F')
Alvine - F
INSERT INTO jaeheon209.name_gender VALUES ('Alvine', 'F')
Adorah - F
INSERT INTO jaeheon209.name_gender VALUES ('Adorah', 'F')
Adlemi - F
INSERT INTO jaeheon209.name_gender VALUES ('Adlemi', 'F')
Alesi - F
INSERT INTO jaeheon209.name_gender VALUES ('Alesi', 'F')
Alontae - M
INSERT INTO jaeheon209.name_gender VALUES ('Alontae', 'M')
Antonny - M
INSERT INTO jaeheon209.name_gender VALUES ('Antonny', 'M')
Adarah - F
INSERT INTO jaeheon209.name_gender VALUES ('Adarah', 'F')
Ayreanna - F
INSERT INTO jaeheon209.name_gender VALUES ('Ayreanna', 'F')
Antyon - M
INSERT INTO jaeheon209.name_gender VALUES ('Antyon', 'M')
Andia - F
INSERT INTO jaeheon209.name_gender VALUES ('Andia', 'F')
Ashla - F
INSERT INTO jaeheon209.name_gender VALUES ('Ashla', 'F')
Aspyn - F
INSERT INTO jaeheon209.name_gender VALUES ('Aspyn', 'F')
Antwanett - F
INSERT INTO jaeheon209.name_gender VALUES ('Antwanett', 'F')
Aundreia - F
INSERT INTO jaeheon209.name_gender VALUES ('Aundreia', 'F')
Audella - F
INSERT INTO jaeheon209.name_gender VALUES ('Audella', 'F')
Amari - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Amari', 'Unisex')
Arsha - Unisex
INSERT INTO jaeheon209.name_gender VALUES ('Arsha', 'Unisex')
Aricella - F
INSERT INTO jaeheon209.name_gender VALUES ('Aricella', 'F')
Adan - M
INSERT INTO jaeheon209.name_gender VALUES ('Adan', 'M')
Apasra - F
INSERT INTO jaeheon209.name_gender VALUES ('Apasra', 'F')
Alaysha - F
INSERT INTO jaeheon209.name_gender VALUES ('Alaysha', 'F')
Anderson - M
INSERT INTO jaeheon209.name_gender VALUES ('Anderson', 'M')
Aurelius - M
INSERT INTO jaeheon209.name_gender VALUES ('Aurelius', 'M')
Aerial - F
INSERT INTO jaeheon209.name_gender VALUES ('Aerial', 'F')
Averleigh - F
INSERT INTO jaeheon209.name_gender VALUES ('Averleigh', 'F')
Aslean - F
INSERT INTO jaeheon209.name_gender VALUES ('Aslean', 'F')
Arniesha - F
INSERT INTO jaeheon209.name_gender VALUES ('Arniesha', 'F')
Asyana - F
INSERT INTO jaeheon209.name_gender VALUES ('Asyana', 'F')
Annjane - F
INSERT INTO jaeheon209.name_gender VALUES ('Annjane', 'F')
Amabella - F
INSERT INTO jaeheon209.name_gender VALUES ('Amabella', 'F')
Austinjohn - M
INSERT INTO jaeheon209.name_gender VALUES ('Austinjohn', 'M')
Arloween - F
INSERT INTO jaeheon209.name_gender VALUES ('Arloween', 'F')
Alula - M
INSERT INTO jaeheon209.name_gender VALUES ('Alula', 'M')
Anemone - F
INSERT INTO jaeheon209.name_gender VALUES ('Anemone', 'F')
Amorina - F
INSERT INTO jaeheon209.name_gender VALUES ('Amorina', 'F')
Anureet - F
INSERT INTO jaeheon209.name_gender VALUES ('Anureet', 'F')
Arric - M
INSERT INTO jaeheon209.name_gender VALUES ('Arric', 'M')
Antonne - M
INSERT INTO jaeheon209.name_gender VALUES ('Antonne', 'M')
Alyre - M
INSERT INTO jaeheon209.name_gender VALUES ('Alyre', 'M')
Annaise - F
INSERT INTO jaeheon209.name_gender VALUES ('Annaise', 'F')